## Pandas Methdos

In [5]:
import pandas as pd

In [57]:

data = {
    "col1" : ["Harsha", "Nakka" , "Bhavesh"],
    "Age" : [22,14,9],
    "class" : ["C","C","C"],
}

# Convert to DataFrame 

df = pd.DataFrame(data)

df

      col1  Age class
0   Harsha   22     C
1    Nakka   14     C
2  Bhavesh    9     C

In [61]:
# Re-Nameing the cols

df = df.rename(columns={"col1":"Name"})
df

      Name  Age class
0   Harsha   22     C
1    Nakka   14     C
2  Bhavesh    9     C

In [62]:
arr4D = [[[ [1,2],[3,4] ] , [ [1,2],[3,4] ] ] , [[[1,2],[3,4]] , [[1,2],[3,4]]]]

In [27]:
arr4D

[[[[1, 2], [3, 4]], [[1, 2], [3, 4]]], [[[1, 2], [3, 4]], [[1, 2], [3, 4]]]]

In [35]:
df4d = pd.DataFrame(arr4D, columns=["col1","col2"])

In [36]:
df4d

               col1              col2
0  [[1, 2], [3, 4]]  [[1, 2], [3, 4]]
1  [[1, 2], [3, 4]]  [[1, 2], [3, 4]]

# Step 3 : Load the dataset from the system

In [98]:
df1 = pd.read_csv("./Datasets/dataset.csv")

In [99]:
# This is to show the starting vaues of the dataset
df1.head(1)

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1

In [73]:
# This shows the last values of the dataset
df1.tail(1)

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [78]:
# This is to check random row in the dataset
df1.sample()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
188,50,1,2,140,233,0,1,163,0,0.6,1,1,3,0

In [79]:
# This is to get the statical data of the dataset
df1.describe()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
count,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000
mean,54.366337,0.683168,0.966997,131.623762,246.264026,0.148515,0.528053,149.646865,0.326733,1.039604,1.399340,0.729373,2.313531,0.544554
std,9.082101,0.466011,1.032052,17.538143,51.830751,0.356198,0.525860,22.905161,0.469794,1.161075,0.616226,1.022606,0.612277,0.498835
min,29.000000,0.000000,0.000000,94.000000,126.000000,0.000000,0.000000,71.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,47.500000,0.000000,0.000000,120.000000,211.000000,0.000000,0.000000,133.500000,0.000000,0.000000,1.000000,0.000000,2.000000,0.000000
50%,55.000000,1.000000,1.000000,130.000000,240.000000,0.000000,1.000000,153.000000,0.000000,0.800000,1.000000,0.000000,2.000000,1.000000
75%,61.000000,1.000000,2.000000,140.000000,274.500000,0.000000,1.000000,166.000000,1.000000,1.600000,2.000000,1.000000,3.000000,1.000000
max,77.000000,1.000000,3.000000,200.000000,564.000000,1.000000,2.000000,202.000000,1.000000,6.200000,2.000000,4.000000,3.000000,1.000000

In [80]:
# This shows the meta data about the given dataset
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       303 non-null    int64
 1   sex       303 non-null    int64
 2   cp        303 non-null    int64
 3   trestbps  303 non-null    int64
 4   chol      303 non-null    int64
 5   fbs       303 non-null    int64
 6   restecg   303 non-null    int64
 7   thalach   303 non-null    int64
 8   exang     303 non-null    int64
 9   oldpeak   303 non-null    float64
 10  slope     303 non-null    int64
 11  ca        303 non-null    int64
 12  thal      303 non-null    int64
 13  target    303 non-null    int64
dtypes: float64(1), int64(13)
memory usage: 33.3 KB

# There r two types of data 
- num
    - Discret
    - continety
- catgorical
    - nomial
    - ordinal

In [82]:
# this shows the missing values the dataset
# df.isnull() shows gives a df of T and F 
# df.isnull().sum() gives the df of all induival missing values 
df.isnull().sum().sum() # gives the missing values in entire df

np.int64(0)

In [92]:
df1['age'].value_counts()

age
58    19
57    17
54    16
59    14
52    13
51    12
62    11
44    11
56    11
60    11
64    10
41    10
63     9
67     9
65     8
53     8
61     8
45     8
43     8
42     8
55     8
66     7
48     7
50     7
46     7
49     5
47     5
68     4
39     4
35     4
70     4
40     3
69     3
38     3
71     3
37     2
34     2
29     1
74     1
76     1
77     1
Name: count, dtype: int64

In [94]:
df1.shape , df1.size

((303, 14), 4242)

In [104]:
df1['age'][0] = np.nan

C:\Users\SriHarshaK\AppData\Local\Temp\ipykernel_7816\3036717211.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['age'][0] = np.nan

In [106]:
df1.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,NaN,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37.0,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41.0,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56.0,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57.0,0,0,120,354,0,1,163,1,0.6,2,0,2,1

In [109]:
# Handling the missing values

df1['age'].fillna(63 , inplace=True)

In [110]:
# sorts the values by age
df1.sort_values(by='age', ascending=True)

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
72,29.0,1,1,130,204,0,0,202,0,0.0,2,0,2,1
58,34.0,1,3,118,182,0,0,174,0,0.0,2,0,2,1
125,34.0,0,1,118,210,0,1,192,0,0.7,2,0,2,1
239,35.0,1,0,126,282,0,0,156,1,0.0,2,0,3,0
227,35.0,1,0,120,198,0,1,130,1,1.6,1,0,3,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25,71.0,0,1,160,302,0,1,162,0,0.4,2,2,2,1
151,71.0,0,0,112,149,0,1,125,0,1.6,1,0,2,1
129,74.0,0,1,120,269,0,0,121,1,0.2,2,1,2,1
144,76.0,0,2,140,197,0,2,116,0,1.1,1,0,2,1
238,77.0,1,0,125,304,0,0,162,1,0.0,2,3,2,0

In [112]:
df1.columns

Index(['age', 'sex', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'target'],
      dtype='object')

In [121]:
df1.groupby(['sex'])['age'].mean()

sex
0    55.677083
1    53.758454
Name: age, dtype: float64